const {cmd , commands} = require( ../command )

cmd({
    pattern: "menu",
    desc: "cybar sithuwa bot menu",
    category: "menu",
    react: "🏴‍☠️",
    filename: __filename
},

async(conn, mek, m,{from, quoted, body, isCmd, command, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply}) => {
try{
let dec = `👋 HEY ${pushname} THIS IS MY MENU 📍

*© OWNERS*  : ᴄʏʙᴀʀ ꜱɪᴛʜᴜᴡᴀ
                      ᴋɪɴɢ ʟᴏᴋᴜ ᴀʙɪʏᴀ
                      ᴋɪɴɢ ʟᴏᴋᴜ ʀᴀꜱʜ
                     ᴋɪɴɢ  ʟᴏᴋᴜ ᴄʜɪᴋᴜ
                      
*© SUPPORTER* : ᴋɪɴɢ ʟᴏᴋᴜ ᴀʙɪʏᴀ

*© NUMBERS* : +94752902163
                        +9477 248 4733
                        +94 72 346 6494
                        +94 74 207 3632
                        
*© SUPPORTER NUMBER* : +94772484733

█▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀█
█-----╦─╦╔╗╦─╔╗╔╗╔╦╗╔╗-----█
█-----║║║╠─║─║─║║║║║╠─-----█
█-----╚╩╝╚╝╚╝╚╝╚╝╩─╩╚╝-----█
█▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄█
*┏════════════❐*  *❐════════════┓*
*🤍🍒CYBABR⊷❍═══❍⊷SITHUWA🍒🤍*
*┗════════════❐*  *❐════════════┛*

𝑺


𝑰


𝑻


𝑯


𝑼


𝑾


𝑨


-


𝑴


𝑫

*┏════════════❐*  *❐════════════┓*
*🤍🍒CYBABR⊷❍═══❍⊷SITHUWA🍒🤍*
*┗════════════❐*  *❐════════════┛**
╭──────────────────━┈⊷
│◦ ✗🤖ʙᴏᴛ ɴᴀᴍᴇ : *𝚂𝙸𝚃𝙷𝚄𝚆𝙰-𝙼𝙳™*
│◦ ✗👤ᴏᴡɴᴇʀ ɴᴀᴍᴇ : *𝙲𝚈𝙱𝙰𝚁 𝚂𝙸𝚃𝙷𝚄𝚆𝙰*
│◦ ✗☎️ᴏᴡɴᴇʀ ɴᴜᴍʙᴇʀ : 94752902163
│◦ ✗⏰ᴜᴘᴛɪᴍᴇ : 3 minutes, 57 seconds
│◦ ✗💾ʀᴀᴍ : 103.82MB / 63276MB
│◦ ✗💫ᴘʀᴇғɪx : .
╰──────────────────━┈⊷
╭──────────●●►
│💗🍒 𝑳𝑰𝑺𝑻 𝑴𝑬𝑵𝑼
╰──────────●●►
┌════════════⊷❍ 
┊ ┏════════════❐
┆1 || 𝑴𝑨𝑰𝑵  𝑴𝑨𝑵𝑼 🍒🤍     
┆ ┗════════════❐ 
┊＿＿＿＿＿＿＿＿＿＿＿
┊ .alive
┊ .menu
┊ .ping
┊ .system
└════════════⊷❍
┌════════════⊷❍ 
┊ ┏════════════❐
┆2 || 𝑫𝑶𝑾𝑵𝑳𝑶𝑨𝑫 𝑴𝑬𝑵𝑼 🍒🤍
┆ ┗════════════❐
┊＿＿＿＿＿＿＿＿＿＿＿
┊ .song
┊ .video
┊ .fb
┊ .mediafire
└════════════⊷❍
┌════════════⊷❍ 
┊┏════════════❐
┆3 || 𝑶𝑾𝑵𝑬𝑹 𝑴𝑬𝑵𝑼 🍒🤍
┆┗════════════❐ 
┊＿＿＿＿＿＿＿＿＿＿＿
┊ .shutdown
┊ .setpp
┊ .block
┊ .unblock
┊ .clearchats
┊ .restart
┊ .broadcast
└════════════⊷❍

*🇦🇱 I AM SITHUWA- MD V2 WHATSAPP  BOT 🇦🇱*

*┏════════════❐*  *❐════════════┓*
  *🤍🍒CYBABR⊷❍═════❍⊷SITHUWA🍒🤍* 
*┗════════════❐*  -❐════════════┛*

*කිරි කිරි බොලේ රැළිරැලි මාලේ රෝස කැලේ අපි යං 🙃🤍🥀
ᴄʜɪᴋɪ ᴄʜɪᴋɪ ʙᴏᴏᴍ ʙᴏᴏᴍ ᴄʜɪᴋɪ ᴄʜɪᴋɪ ʙᴏᴏᴍ ʙᴏᴏᴍ 🤭*

> POWERED BY  CYBAR SITHUWA🚩`
await conn.sendMessage(from,{image:{url: `https://i.ibb.co/DPzq9NCw/IMG-20250206-WA0018.jpg`},caption:dec},{quoted:mek});

}catch(e){
console.log(e)
reply(`${e}`)
}
})
